## For this project, and ease of documenting, I decided to run mysql in jupyter notebook and if you want to learn how to do this -- check here - https://github.com/BamiseOmolaso/SQL-solutions-to-Dannys-diner---Case-Study-1/blob/main/Dannys%20diner%20solution%20-%20Case%20study%201.ipynb


### Note:  I have made references to all the resources I found helpful online

In [1]:
import sql
from sqlalchemy import create_engine

In [4]:
%load_ext sql
%sql mysql://Bamise:*********@localhost/pizza_runner  #I edited out my password here

## Kindly note that I use MySQL and will only write syntax inline with it. If you use a different database you can check the databases' documentation for the alternative syntax that will work for you

### As always with Dannys projects, I had to work on creating the database and I use MySQL.

### I copied the information into my sql and adjusted it according to the syntax-- you can find a copy of the file= simply copy and run

### After loading the file, let us inspect our tables

## Data cleaning and transformation

In [5]:
%%sql

### Lets Investigate The Tables Fist
# Check out the tables metadata

SELECT
 table_name,
 column_name,
 data_type
FROM information_schema.columns
WHERE table_name = 'customer_orders';

   mysql://Bamise:***@localhost/dannys_diner
 * mysql://Bamise:***@localhost/pizza_runner
6 rows affected.
6 rows affected.

[('customer_orders', 'customer_id', 'int'),
 ('customer_orders', 'exclusions', 'varchar'),
 ('customer_orders', 'extras', 'varchar'),
 ('customer_orders', 'order_id', 'int'),
 ('customer_orders', 'order_time', 'timestamp'),
 ('customer_orders', 'pizza_id', 'int')]

In [6]:
%%sql

### Lets Investigate The Tables Fist
# Check out the tables metadata

SELECT
 table_name,
 column_name,
 data_type
FROM information_schema.columns
WHERE table_name = 'runner_orders';

   mysql://Bamise:***@localhost/dannys_diner
 * mysql://Bamise:***@localhost/pizza_runner
6 rows affected.

[('runner_orders', 'cancellation', 'varchar'),
 ('runner_orders', 'distance', 'varchar'),
 ('runner_orders', 'duration', 'varchar'),
 ('runner_orders', 'order_id', 'int'),
 ('runner_orders', 'pickup_time', 'varchar'),
 ('runner_orders', 'runner_id', 'int')]

### -- Let's clean up the 2 main tables - Customer and runner orders by creating new tables

### -- We will update the blank values to show as NULL to indicate no customers orders extras/exclusions

### -- Current "null" in table is being interpreted as a string and will be replaced with null

### -- Two methods: either we use "case when" to create temporary tables or we use DML(Data Manipulation language) - SET and create either temporary or permanent tables

### -- To try our methods we need to create temporary tables and I used the show table and copied out the script for the original table and edited it to the new table.

### -- A useful resource to learn more on how I did it - https://www.devart.com/dbforge/mysql/studio/mysql-copy-table.html

In [7]:
%%sql

### Lets Investigate The Tables Fist
# Check out the tables metadata

SELECT *
FROM customer_orders

# -- As we can see below: 
# -- 1. there are missing values in the exclusions and extras columns
# -- 2. there are string 'null' values that we intend to change to NULL values

   mysql://Bamise:***@localhost/dannys_diner
 * mysql://Bamise:***@localhost/pizza_runner
14 rows affected.

[(1, 101, 1, '', '', datetime.datetime(2020, 1, 1, 18, 5, 2)),
 (2, 101, 1, '', '', datetime.datetime(2020, 1, 1, 19, 0, 52)),
 (3, 102, 1, '', '', datetime.datetime(2020, 1, 2, 23, 51, 23)),
 (3, 102, 2, '', None, datetime.datetime(2020, 1, 2, 23, 51, 23)),
 (4, 103, 1, '4', '', datetime.datetime(2020, 1, 4, 13, 23, 46)),
 (4, 103, 1, '4', '', datetime.datetime(2020, 1, 4, 13, 23, 46)),
 (4, 103, 2, '4', '', datetime.datetime(2020, 1, 4, 13, 23, 46)),
 (5, 104, 1, 'null', '1', datetime.datetime(2020, 1, 8, 21, 0, 29)),
 (6, 101, 2, 'null', 'null', datetime.datetime(2020, 1, 8, 21, 3, 13)),
 (7, 105, 2, 'null', '1', datetime.datetime(2020, 1, 8, 21, 20, 29)),
 (8, 102, 1, 'null', 'null', datetime.datetime(2020, 1, 9, 23, 54, 33)),
 (9, 103, 1, '4', '1, 5', datetime.datetime(2020, 1, 10, 11, 22, 59)),
 (10, 104, 1, 'null', 'null', datetime.datetime(2020, 1, 11, 18, 34, 49)),
 (10, 104, 1, '2, 6', '1, 4', datetime.datetime(2020, 1, 11, 18, 34, 49))]

In [10]:
%%sql

### Lets Investigate The Tables Fist
# Check out the tables metadata

SELECT *
FROM runner_orders

# -- As we can see below:
# 1. There are missing values and string values (none, null) in cancellation column which can simply be replaced with NULL to make our query simple
# 2. There are string values in distance and duration as km, minutes e.t.c which will be trimmed off to leave only integers

   mysql://Bamise:***@localhost/dannys_diner
 * mysql://Bamise:***@localhost/pizza_runner
10 rows affected.

[(1, 1, '2020-01-01 18:15:34', '20km', '32 minutes', ''),
 (2, 1, '2020-01-01 19:10:54', '20km', '27 minutes', ''),
 (3, 1, '2020-01-03 00:12:37', '13.4km', '20 mins', None),
 (4, 2, '2020-01-04 13:53:03', '23.4', '40', None),
 (5, 3, '2020-01-08 21:10:57', '10', '15', None),
 (6, 3, 'null', 'null', 'null', 'Restaurant Cancellation'),
 (7, 2, '2020-01-08 21:30:45', '25km', '25mins', 'null'),
 (8, 2, '2020-01-10 00:15:02', '23.4 km', '15 minute', 'null'),
 (9, 2, 'null', 'null', 'null', 'Customer Cancellation'),
 (10, 1, '2020-01-11 18:50:20', '10km', '10minutes', 'null')]

## -- let us start with Customer_orders Table : we will create a new table: customer_orders_temp


## -- METHOD 1 - Using UPDATE AND SET to create a new table customer_orders_temp like Bitiya did here - https://www.kaggle.com/code/bitiyaa/sql-case-study-2-pizza-runner/script

In [12]:
%%sql


DROP TABLE IF EXISTS customer_orders_temp;

CREATE TABLE customer_orders_temp LIKE customer_orders;
INSERT customer_orders_temp SELECT * FROM customer_orders;

# -- What this code does is to first create a copy of the customers table 
# -- The copy does not have the content, hence, you need to use inset to import it

   mysql://Bamise:***@localhost/dannys_diner
 * mysql://Bamise:***@localhost/pizza_runner
0 rows affected.
0 rows affected.
14 rows affected.
0 rows affected.

[]

In [13]:
%%sql

##--then i ran the following queries one after the other to update our table

UPDATE customer_orders_temp 
SET extras = NULL WHERE extras = '';

   mysql://Bamise:***@localhost/dannys_diner
 * mysql://Bamise:***@localhost/pizza_runner
6 rows affected.

[]

In [14]:
%%sql

UPDATE customer_orders_temp 
SET extras = NULL WHERE extras = 'null';

   mysql://Bamise:***@localhost/dannys_diner
 * mysql://Bamise:***@localhost/pizza_runner
3 rows affected.

[]

In [15]:
%%sql

UPDATE customer_orders_temp 
SET exclusions = NULL WHERE exclusions = '';

   mysql://Bamise:***@localhost/dannys_diner
 * mysql://Bamise:***@localhost/pizza_runner
4 rows affected.

[]

In [16]:
%%sql

UPDATE customer_orders_temp 
SET exclusions = NULL WHERE exclusions = 'null';

   mysql://Bamise:***@localhost/dannys_diner
 * mysql://Bamise:***@localhost/pizza_runner
5 rows affected.

[]

In [17]:
%%sql

-- let us check the data to confirm the changes
select *
from customer_orders;

   mysql://Bamise:***@localhost/dannys_diner
 * mysql://Bamise:***@localhost/pizza_runner
14 rows affected.

[(1, 101, 1, '', '', datetime.datetime(2020, 1, 1, 18, 5, 2)),
 (2, 101, 1, '', '', datetime.datetime(2020, 1, 1, 19, 0, 52)),
 (3, 102, 1, '', '', datetime.datetime(2020, 1, 2, 23, 51, 23)),
 (3, 102, 2, '', None, datetime.datetime(2020, 1, 2, 23, 51, 23)),
 (4, 103, 1, '4', '', datetime.datetime(2020, 1, 4, 13, 23, 46)),
 (4, 103, 1, '4', '', datetime.datetime(2020, 1, 4, 13, 23, 46)),
 (4, 103, 2, '4', '', datetime.datetime(2020, 1, 4, 13, 23, 46)),
 (5, 104, 1, 'null', '1', datetime.datetime(2020, 1, 8, 21, 0, 29)),
 (6, 101, 2, 'null', 'null', datetime.datetime(2020, 1, 8, 21, 3, 13)),
 (7, 105, 2, 'null', '1', datetime.datetime(2020, 1, 8, 21, 20, 29)),
 (8, 102, 1, 'null', 'null', datetime.datetime(2020, 1, 9, 23, 54, 33)),
 (9, 103, 1, '4', '1, 5', datetime.datetime(2020, 1, 10, 11, 22, 59)),
 (10, 104, 1, 'null', 'null', datetime.datetime(2020, 1, 11, 18, 34, 49)),
 (10, 104, 1, '2, 6', '1, 4', datetime.datetime(2020, 1, 11, 18, 34, 49))]

In [18]:
%%sql
select *
from customer_orders_temp;

   mysql://Bamise:***@localhost/dannys_diner
 * mysql://Bamise:***@localhost/pizza_runner
14 rows affected.

[(1, 101, 1, None, None, datetime.datetime(2020, 1, 1, 18, 5, 2)),
 (2, 101, 1, None, None, datetime.datetime(2020, 1, 1, 19, 0, 52)),
 (3, 102, 1, None, None, datetime.datetime(2020, 1, 2, 23, 51, 23)),
 (3, 102, 2, None, None, datetime.datetime(2020, 1, 2, 23, 51, 23)),
 (4, 103, 1, '4', None, datetime.datetime(2020, 1, 4, 13, 23, 46)),
 (4, 103, 1, '4', None, datetime.datetime(2020, 1, 4, 13, 23, 46)),
 (4, 103, 2, '4', None, datetime.datetime(2020, 1, 4, 13, 23, 46)),
 (5, 104, 1, None, '1', datetime.datetime(2020, 1, 8, 21, 0, 29)),
 (6, 101, 2, None, None, datetime.datetime(2020, 1, 8, 21, 3, 13)),
 (7, 105, 2, None, '1', datetime.datetime(2020, 1, 8, 21, 20, 29)),
 (8, 102, 1, None, None, datetime.datetime(2020, 1, 9, 23, 54, 33)),
 (9, 103, 1, '4', '1, 5', datetime.datetime(2020, 1, 10, 11, 22, 59)),
 (10, 104, 1, None, None, datetime.datetime(2020, 1, 11, 18, 34, 49)),
 (10, 104, 1, '2, 6', '1, 4', datetime.datetime(2020, 1, 11, 18, 34, 49))]

### -- Do you notice the difference between the tables now? Our customer_orders_temp table has been cleaned


### -- Mind you, in jupyter notebook, it replaces empty with none unlike in the MySQL workbench where it inidicates it as NULL

In [11]:
%%sql

SELECT *
FROM customer_orders_temp

   mysql://Bamise:***@localhost/dannys_diner
 * mysql://Bamise:***@localhost/pizza_runner
14 rows affected.

[(1, 101, 1, None, None, datetime.datetime(2020, 1, 1, 18, 5, 2)),
 (2, 101, 1, None, None, datetime.datetime(2020, 1, 1, 19, 0, 52)),
 (3, 102, 1, None, None, datetime.datetime(2020, 1, 2, 23, 51, 23)),
 (3, 102, 2, None, None, datetime.datetime(2020, 1, 2, 23, 51, 23)),
 (4, 103, 1, '4', None, datetime.datetime(2020, 1, 4, 13, 23, 46)),
 (4, 103, 1, '4', None, datetime.datetime(2020, 1, 4, 13, 23, 46)),
 (4, 103, 2, '4', None, datetime.datetime(2020, 1, 4, 13, 23, 46)),
 (5, 104, 1, None, '1', datetime.datetime(2020, 1, 8, 21, 0, 29)),
 (6, 101, 2, None, None, datetime.datetime(2020, 1, 8, 21, 3, 13)),
 (7, 105, 2, None, '1', datetime.datetime(2020, 1, 8, 21, 20, 29)),
 (8, 102, 1, None, None, datetime.datetime(2020, 1, 9, 23, 54, 33)),
 (9, 103, 1, '4', '1, 5', datetime.datetime(2020, 1, 10, 11, 22, 59)),
 (10, 104, 1, None, None, datetime.datetime(2020, 1, 11, 18, 34, 49)),
 (10, 104, 1, '2, 6', '1, 4', datetime.datetime(2020, 1, 11, 18, 34, 49))]

### -- METHOD 2 involves using a case statement as Katie did here - https://medium.com/analytics-vidhya/8-week-sql-challenge-case-study-2-pizza-runner-ba32f0a6f9fb 

### or manaswikamila did here too -- https://github.com/manaswikamila05/8-Week-SQL-Challenge/blob/main/Case%20Study%20%23%202%20-%20Pizza%20Runner/0.%20Data%20Clean.md

### To streamline the code, i did not run it here even though I tested it out myself by creating a new table customer_orders_temp_2 and I recommend working around it.

## -- Now, Let's clean up the runners table

In [19]:
%%sql

select *
FROM runner_orders;

   mysql://Bamise:***@localhost/dannys_diner
 * mysql://Bamise:***@localhost/pizza_runner
10 rows affected.

[(1, 1, '2020-01-01 18:15:34', '20km', '32 minutes', ''),
 (2, 1, '2020-01-01 19:10:54', '20km', '27 minutes', ''),
 (3, 1, '2020-01-03 00:12:37', '13.4km', '20 mins', None),
 (4, 2, '2020-01-04 13:53:03', '23.4', '40', None),
 (5, 3, '2020-01-08 21:10:57', '10', '15', None),
 (6, 3, 'null', 'null', 'null', 'Restaurant Cancellation'),
 (7, 2, '2020-01-08 21:30:45', '25km', '25mins', 'null'),
 (8, 2, '2020-01-10 00:15:02', '23.4 km', '15 minute', 'null'),
 (9, 2, 'null', 'null', 'null', 'Customer Cancellation'),
 (10, 1, '2020-01-11 18:50:20', '10km', '10minutes', 'null')]

### -- In summary, we will 

### -- Create a new table - runner_orders_temp using method 1

### Then, edit the following columns in the runner_orders_temp table

### -- pickup_time — Remove nulls and replace with NULL

### -- cancellation — Remove null and replace with NULL

### -- distance — Remove(trim) ‘km’ to integers only and replace nulls with NULL

### -- duration — Remove(trim) ‘minutes’ to integers only and replace nulls with NULL

In [20]:
%%sql

DROP TABLE IF EXISTS runner_orders_temp;

   mysql://Bamise:***@localhost/dannys_diner
 * mysql://Bamise:***@localhost/pizza_runner
0 rows affected.

[]

In [21]:
%%sql

# -- We will employ method 1

CREATE TABLE runner_orders_temp LIKE runner_orders; 
INSERT runner_orders_temp SELECT * FROM runner_orders;

   mysql://Bamise:***@localhost/dannys_diner
 * mysql://Bamise:***@localhost/pizza_runner
0 rows affected.
10 rows affected.

[]

In [22]:
%%sql

UPDATE runner_orders_temp SET distance = NULL WHERE distance = '';

   mysql://Bamise:***@localhost/dannys_diner
 * mysql://Bamise:***@localhost/pizza_runner
0 rows affected.

[]

In [23]:
%%sql

UPDATE runner_orders_temp SET distance = NULL WHERE distance = 'null';

   mysql://Bamise:***@localhost/dannys_diner
 * mysql://Bamise:***@localhost/pizza_runner
2 rows affected.

[]

In [24]:
%%sql

UPDATE runner_orders_temp SET pickup_time = NULL WHERE pickup_time = '';

   mysql://Bamise:***@localhost/dannys_diner
 * mysql://Bamise:***@localhost/pizza_runner
0 rows affected.

[]

In [25]:
%%sql

UPDATE runner_orders_temp SET pickup_time = NULL WHERE pickup_time = 'null';

   mysql://Bamise:***@localhost/dannys_diner
 * mysql://Bamise:***@localhost/pizza_runner
2 rows affected.

[]

In [26]:
%%sql

UPDATE runner_orders_temp SET duration = NULL WHERE duration = '';

   mysql://Bamise:***@localhost/dannys_diner
 * mysql://Bamise:***@localhost/pizza_runner
0 rows affected.

[]

In [27]:
%%sql

UPDATE runner_orders_temp SET duration = NULL WHERE duration = 'null';

   mysql://Bamise:***@localhost/dannys_diner
 * mysql://Bamise:***@localhost/pizza_runner
2 rows affected.

[]

In [28]:
%%sql

UPDATE runner_orders_temp SET cancellation = NULL WHERE cancellation = '';

   mysql://Bamise:***@localhost/dannys_diner
 * mysql://Bamise:***@localhost/pizza_runner
2 rows affected.

[]

In [29]:
%%sql

UPDATE runner_orders_temp SET cancellation = NULL WHERE cancellation = 'null';

   mysql://Bamise:***@localhost/dannys_diner
 * mysql://Bamise:***@localhost/pizza_runner
3 rows affected.

[]

In [30]:
%%sql

UPDATE runner_orders_temp SET distance = TRIM('km' from distance) WHERE distance like '%km';

   mysql://Bamise:***@localhost/dannys_diner
 * mysql://Bamise:***@localhost/pizza_runner
6 rows affected.

[]

In [31]:
%%sql

UPDATE runner_orders_temp SET duration = TRIM('mins' from duration) WHERE duration like '%mins';

   mysql://Bamise:***@localhost/dannys_diner
 * mysql://Bamise:***@localhost/pizza_runner
2 rows affected.

[]

In [32]:
%%sql

UPDATE runner_orders_temp SET duration = TRIM('minutes' from duration) WHERE duration like '%minutes';

   mysql://Bamise:***@localhost/dannys_diner
 * mysql://Bamise:***@localhost/pizza_runner
3 rows affected.

[]

In [33]:
%%sql

UPDATE runner_orders_temp SET duration = TRIM('minute' from duration) WHERE duration like '%minute';

   mysql://Bamise:***@localhost/dannys_diner
 * mysql://Bamise:***@localhost/pizza_runner
1 rows affected.

[]

In [34]:
%%sql

# Let's check our table again

select *
FROM runner_orders_temp;

   mysql://Bamise:***@localhost/dannys_diner
 * mysql://Bamise:***@localhost/pizza_runner
10 rows affected.

[(1, 1, '2020-01-01 18:15:34', '20', '32 ', None),
 (2, 1, '2020-01-01 19:10:54', '20', '27 ', None),
 (3, 1, '2020-01-03 00:12:37', '13.4', '20 ', None),
 (4, 2, '2020-01-04 13:53:03', '23.4', '40', None),
 (5, 3, '2020-01-08 21:10:57', '10', '15', None),
 (6, 3, None, None, None, 'Restaurant Cancellation'),
 (7, 2, '2020-01-08 21:30:45', '25', '25', None),
 (8, 2, '2020-01-10 00:15:02', '23.4 ', '15 ', None),
 (9, 2, None, None, None, 'Customer Cancellation'),
 (10, 1, '2020-01-11 18:50:20', '10', '10', None)]

#### Now that our table is cleaned, let's explore the questions

#### A. Pizza Metrics
#### 1. How many pizzas were ordered?
#### 2. How many unique customer orders were made?
#### 3. How many successful orders were delivered by each runner?
#### 4. How many of each type of pizza was delivered?
#### 5. How many Vegetarian and Meatlovers were ordered by each customer?
#### 6. What was the maximum number of pizzas delivered in a single order?
#### 7. For each customer, how many delivered pizzas had at least 1 change and how many had no changes?
#### 8. How many pizzas were delivered that had both exclusions and extras?
#### 9. What was the total volume of pizzas ordered for each hour of the day?
#### 10. What was the volume of orders for each day of the week?

### -- 1. How many pizzas were ordered?

#### This simply involves looking at the table that has the  pizza id and using the count function to evaluate

In [35]:
%%sql

select count(pizza_id) as Total_pizza_orders
from customer_orders_temp;

   mysql://Bamise:***@localhost/dannys_diner
 * mysql://Bamise:***@localhost/pizza_runner
1 rows affected.

[(14,)]

### --2. How many unique customer orders were made?

#### "How many" --  means we have to count
#### "unique customer orders"- means we need to use the distinct function with the order_id and the output is below

In [37]:
%%sql

select count(distinct(order_id)) as Total_unique_orders
from customer_orders_temp;

   mysql://Bamise:***@localhost/dannys_diner
 * mysql://Bamise:***@localhost/pizza_runner
1 rows affected.

[(10,)]

### -- 3. How many successful orders were delivered by each runner?

#### "How many" --  means we have to count

#### "successful orders"- means we need to identify the orders with the order_id but with a clause - "Successful" meaning we have to set our where clause for cancellation to be NULL or distance not equal (!=) zero or IS NOT NULL to indicate that the selected order was successful

#### by EACH runner - means we have to GROUP BY runner_id for each runner 


#### PS I will stick to method 1 for the rest of the solution whenever i want to select successful orders

In [38]:
%%sql

# Method 1 using cancellation = null

select runner_id, count(order_id) as Successful_orders
from runner_orders_temp
where cancellation IS NULL
group by runner_id;

   mysql://Bamise:***@localhost/dannys_diner
 * mysql://Bamise:***@localhost/pizza_runner
3 rows affected.

[(1, 4), (2, 3), (3, 1)]

In [41]:
%%sql

# Method 2 using distance IS NOT NULL

SELECT runner_id, COUNT(order_id) AS successful_orders
FROM runner_orders_temp
WHERE distance IS NOT NULL 
GROUP BY runner_id;

   mysql://Bamise:***@localhost/dannys_diner
 * mysql://Bamise:***@localhost/pizza_runner
3 rows affected.

[(1, 4), (2, 3), (3, 1)]

### -- 4. How many of each type of pizza was delivered?

#### "How many" --  means we have to count

#### "each type of pizza was delivered"- means we need to identify the pizzas with the pizza_id and or pizza_name but with a clause - "delivered" meaning we have to set our WHERE clause for cancellation to be NULL or distance not equal (!=) zero or distance IS NOT NULL to indicate that the selected pizza was delivered

#### by EACH type of pizza - means we have to GROUP BY pizza_name and or pizza_id for each pizza 


#### PS I will stick to method 1 for the rest of the solution whenever i want to select successful orders

In [42]:
%%sql

select c.pizza_id, p.pizza_name, count(c.pizza_id) as pizza_count
from customer_orders_temp c
inner join runner_orders_temp r on c.order_id = r.order_id
inner join pizza_names p on c.pizza_id = p.pizza_id
where r.cancellation is null
group by p.pizza_name;

   mysql://Bamise:***@localhost/dannys_diner
 * mysql://Bamise:***@localhost/pizza_runner
2 rows affected.

[(1, 'Meatlovers', 9), (2, 'Vegetarian', 3)]

### -- 5. How many Vegetarian and Meatlovers were ordered by each customer?

### - Two methods - Method 1

#### "How many" --  means we have to count the pizza_name or pizza_id (i used pizza_name here)

#### "Vegetarian and Meatlovers"- means we need to SELECT the pizza_names

#### ordered by EACH customer - means we need to GROUP BY customer_id

### Method 2- We can use CASE STATEMENT to create two new columns each for vegetarian and meatlovers respectively

### Which method do you like better?

In [43]:
%%sql

select c.customer_id, p.pizza_name, count(p.pizza_name) as pizza_count
from customer_orders_temp c
join pizza_names p on c.pizza_id = p.pizza_id
group by c.customer_id, p.pizza_name
order by c.customer_id;

   mysql://Bamise:***@localhost/dannys_diner
 * mysql://Bamise:***@localhost/pizza_runner
8 rows affected.

[(101, 'Meatlovers', 2),
 (101, 'Vegetarian', 1),
 (102, 'Meatlovers', 2),
 (102, 'Vegetarian', 1),
 (103, 'Meatlovers', 3),
 (103, 'Vegetarian', 1),
 (104, 'Meatlovers', 3),
 (105, 'Vegetarian', 1)]

In [44]:
%%sql

SELECT customer_id,
       SUM(CASE
               WHEN pizza_id = 1 THEN 1
               ELSE 0
           END) AS 'Meat lover Pizza Count',
       SUM(CASE
               WHEN pizza_id = 2 THEN 1
               ELSE 0
           END) AS 'Vegetarian Pizza Count'
FROM customer_orders_temp
GROUP BY customer_id
ORDER BY customer_id;

   mysql://Bamise:***@localhost/dannys_diner
 * mysql://Bamise:***@localhost/pizza_runner
5 rows affected.

[(101, Decimal('2'), Decimal('1')),
 (102, Decimal('2'), Decimal('1')),
 (103, Decimal('3'), Decimal('1')),
 (104, Decimal('3'), Decimal('0')),
 (105, Decimal('0'), Decimal('1'))]

### -- 6. What was the maximum number of pizzas delivered in a single order?

#### "Maximum number of pizzas" --  means we have to count the number of pizzas which can be done with the pizza_id

#### "delivered"- means we need to SELECT the pizzas that were delivered

#### single order- means we need to group by order_id - because the same orders have the same id although different pizzas might be requested

#### note i used "USING" here because it's another way to join tables with common keys incase you are not familiar with it.

In [45]:
%%sql

select order_id, count(pizza_id) as max_pizza_per_order
from customer_orders_temp
join runner_orders_temp using (order_id)
where cancellation is null
group by order_id
order by max_pizza_per_order desc limit 1;

   mysql://Bamise:***@localhost/dannys_diner
 * mysql://Bamise:***@localhost/pizza_runner
1 rows affected.

[(4, 3)]

### -- 7. For each customer, how many delivered pizzas had at least 1 change and how many had no changes?

#### You have to understand that making a change to your pizza here is either requesting for an exclusion or extra

#### Method - We can use CASE STATEMENT to create two new columns each for change_in_pizza and no_change_in_pizza respectively

#### "How many" --  means we have to the change or no change (in this case- sum)

#### "delivered"- means we need to select orders that were delivered

#### "each customer" - means we have to group by customer_id

In [ ]:
%%sql

SELECT c.customer_id,
       SUM(CASE
               WHEN (exclusions IS NOT NULL
                     OR extras IS NOT NULL) THEN 1
               ELSE 0
           END) AS change_in_pizza,
       SUM(CASE
               WHEN (exclusions IS NULL
                     AND extras IS NULL) THEN 1
               ELSE 0
           END) AS no_change_in_pizza
FROM customer_orders_temp c
INNER JOIN runner_orders_temp r on c.order_id = r.order_id
WHERE cancellation IS NULL
GROUP BY customer_id
ORDER BY customer_id;

### -- 8. How many pizzas were delivered that had both exclusions and extras?

#### This is somewhat opposite to the above

#### Method 1- We can use CASE STATEMENT to create a new column for both_change_in_pizza 

#### "How many" --  means we have to the change or no change (in this case- sum)

#### "delivered"- means we need to select orders that were delivered

#### Method 2 - I can do without the case statement and just use my WHERE clause to get what I want

In [46]:
%%sql

SELECT customer_id,
       SUM(CASE
               WHEN (exclusions IS NOT NULL
                     AND extras IS NOT NULL) THEN 1
               ELSE 0
           END) AS both_change_in_pizza
FROM customer_orders_temp
INNER JOIN runner_orders_temp USING (order_id)
WHERE cancellation IS NULL
GROUP BY customer_id
ORDER BY customer_id;

   mysql://Bamise:***@localhost/dannys_diner
 * mysql://Bamise:***@localhost/pizza_runner
5 rows affected.

[(101, Decimal('0')),
 (102, Decimal('0')),
 (103, Decimal('0')),
 (104, Decimal('1')),
 (105, Decimal('0'))]

In [48]:
%%sql

select c.customer_id, count(pizza_id) as delivered_with_extras_and_exclusions
from customer_orders_temp c
join runner_orders_temp r on c.order_id = r.order_id
where cancellation is null and exclusions is not null and extras is not null 
group by customer_id
order by customer_id;

   mysql://Bamise:***@localhost/dannys_diner
 * mysql://Bamise:***@localhost/pizza_runner
1 rows affected.

[(104, 1)]

### -- 9. What was the total volume of pizzas ordered for each hour of the day?

#### This, I had to use an inbuilt function to select the hour out of each order_time

#### Total volume means - we need to sum or count the entire orders and then group it by each hour of the day

In [49]:
%%sql

SELECT HOUR(order_time) AS hour_of_day, 
 COUNT(order_id) AS pizza_count
FROM customer_orders_temp
group by HOUR(order_time)
order by HOUR(order_time);

   mysql://Bamise:***@localhost/dannys_diner
 * mysql://Bamise:***@localhost/pizza_runner
6 rows affected.

[(11, 1), (13, 3), (18, 3), (19, 1), (21, 3), (23, 3)]

### -- 10. What was the volume of orders for each day of the week?

#### This, I had to use an inbuilt function to select the days of the week out of each order_time

#### Total volume means - we need to sum or count the entire orders and then group it by each day of the week

#### we can express the volume in percentage

In [50]:
%%sql

SELECT dayname(order_time) AS 'Day Of Week',
       count(order_id) AS 'Number of pizzas ordered',
       round(100*count(order_id) /sum(count(order_id)) over(), 2) AS 'Volume of pizzas ordered'
FROM pizza_runner.customer_orders_temp
GROUP BY 1
ORDER BY 2 DESC;

   mysql://Bamise:***@localhost/dannys_diner
 * mysql://Bamise:***@localhost/pizza_runner
4 rows affected.

[('Wednesday', 5, Decimal('35.71')),
 ('Saturday', 5, Decimal('35.71')),
 ('Thursday', 3, Decimal('21.43')),
 ('Friday', 1, Decimal('7.14'))]

### I will update when I work around the other questions for more solutions.